Cinema/src/Reports/НаЭтойНеделеВКино/НаЭтойНеделеВКино.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>НаЭтойНеделеВКино</name>
</mdclass:Report>

Cinema/src/InformationRegisters/СтраныПроизводители/СтраныПроизводители.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтраныПроизводители</name>
  <dimensions>
    <name>Фильм</name>
    <type>
      <types>CatalogRef.Фильмы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Страна</name>
    <type>
      <types>CatalogRef.Страны</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Cinema/src/InformationRegisters/ЖанрыФильмов/ЖанрыФильмов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЖанрыФильмов</name>
  <dimensions>
    <name>Фильм</name>
    <type>
      <types>CatalogRef.Фильмы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Жанр</name>
    <type>
      <types>CatalogRef.Жанры</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Cinema/src/Catalogs/Фильмы/Фильмы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Фильмы</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Афиша</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ВысотаИзображения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВыхода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьВФильмотеке</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаполненКорректно</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяФайла</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НужноСкачать</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОригинальноеНазвание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПросмотреноВКино</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РазмерИзображения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РазмерФайла</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Формат3D</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦифровойРелиз</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ШиринаИзображения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

Cinema/src/Reports/НаЭтойНеделеВКино/ObjectModule.bsl
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	
	// Получение параметра пользовательских настроек
	Текущая_Дата   = ТекущаяДатаСеанса();
	ПараметрДанных = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("ТекущаяДата");
	Если ПараметрДанных <> Неопределено Тогда
		Для каждого ЭлементПользовательскойНастройки Из КомпоновщикНастроек.ПользовательскиеНастройки.Элементы Цикл
			Если ЭлементПользовательскойНастройки.ИдентификаторПользовательскойНастройки = ПараметрДанных.ИдентификаторПользовательскойНастройки
				И ЭлементПользовательскойНастройки.Использование И ЗначениеЗаполнено(ЭлементПользовательскойНастройки.Значение)
			Тогда
				Если ТипЗнч(ЭлементПользовательскойНастройки.Значение) = Тип("СтандартнаяДатаНачала") Тогда
					Текущая_Дата = ЭлементПользовательскойНастройки.Значение.Дата;
				ИначеЕсли ТипЗнч(ЭлементПользовательскойНастройки.Значение) = Тип("Дата") Тогда
					Текущая_Дата = ЭлементПользовательскойНастройки.Значение;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущаяДата", Текущая_Дата);
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Фильмы.Ссылка КАК Фильм,
		|	Фильмы.Наименование + ВЫБОР
		|		КОГДА Фильмы.ОригинальноеНазвание = """"
		|			ТОГДА """"
		|		ИНАЧЕ "" ("" + Фильмы.ОригинальноеНазвание + "")""
		|	КОНЕЦ + ВЫБОР
		|		КОГДА Фильмы.Формат3D
		|			ТОГДА "" 3D""
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК Наименование,
		|	Фильмы.ДатаВыхода КАК ДатаВыхода,
		|	Фильмы.Афиша КАК Афиша
		|ПОМЕСТИТЬ Фильмы
		|ИЗ
		|	Справочник.Фильмы КАК Фильмы
		|ГДЕ
		|	НЕ Фильмы.ПометкаУдаления
		|	И Фильмы.ДатаВыхода МЕЖДУ НАЧАЛОПЕРИОДА(&ТекущаяДата, НЕДЕЛЯ) И КОНЕЦПЕРИОДА(&ТекущаяДата, НЕДЕЛЯ)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СтраныПроизводители.Фильм КАК Фильм,
		|	СтраныПроизводители.Страна.Представление КАК Страна
		|ИЗ
		|	РегистрСведений.СтраныПроизводители КАК СтраныПроизводители
		|ГДЕ
		|	СтраныПроизводители.Фильм В
		|			(ВЫБРАТЬ
		|				Фильмы.Фильм КАК Фильм
		|			ИЗ
		|				Фильмы КАК Фильмы)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Фильм
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЖанрыФильмов.Фильм КАК Фильм,
		|	ЖанрыФильмов.Жанр.Представление КАК Жанр
		|ИЗ
		|	РегистрСведений.ЖанрыФильмов КАК ЖанрыФильмов
		|ГДЕ
		|	ЖанрыФильмов.Фильм В
		|			(ВЫБРАТЬ
		|				Фильмы.Фильм КАК Фильм
		|			ИЗ
		|				Фильмы КАК Фильмы)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Фильм
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Фильмы.Фильм КАК Фильм,
		|	Фильмы.Наименование КАК Наименование,
		|	Фильмы.ДатаВыхода КАК ДатаВыхода,
		|	Фильмы.Афиша КАК Афиша,
		|	ВЫРАЗИТЬ("""" КАК СТРОКА(999)) КАК Жанр,
		|	ВЫРАЗИТЬ("""" КАК СТРОКА(999)) КАК Страна
		|ИЗ
		|	Фильмы КАК Фильмы";
	
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	НаибольшийИндекс  = РезультатыЗапроса.ВГраница();
	НаЭтойНеделеВКино = РезультатыЗапроса.Получить(НаибольшийИндекс).Выгрузить();
	СтруктураПолей    = Новый Структура("Жанр, Страна");
	СтруктураПоиска   = Новый Структура("Фильм");
	
	Для каждого СтрокаТаблицыДанных Из НаЭтойНеделеВКино Цикл
		
		ЗаполнитьЗначенияСвойств(СтруктураПоиска, СтрокаТаблицыДанных);
		ТекущийИндекс = НаибольшийИндекс;
	
		Для каждого КлючИЗначение Из СтруктураПолей Цикл
			
			ТекущийИндекс   = ТекущийИндекс - 1;
			Выборка         = РезультатыЗапроса.Получить(ТекущийИндекс).Выбрать();
			ЗначениеКолонки = "";
			
			Пока Выборка.НайтиСледующий(СтруктураПоиска) Цикл
				ЗначениеКолонки = ЗначениеКолонки + ?(ПустаяСтрока(ЗначениеКолонки), "", ", ") + Выборка[КлючИЗначение.Ключ];
			КонецЦикла;
			 
			СтрокаТаблицыДанных[КлючИЗначение.Ключ] = ЗначениеКолонки;
			
		КонецЦикла;
	
	КонецЦикла;

	ВнешниеНаборыДанных = Новый Структура("НаЭтойНеделеВКино", НаЭтойНеделеВКино);
	КомпоновщикМакета   = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки     = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, СхемаКомпоновкиДанных.НастройкиПоУмолчанию, ДанныеРасшифровки);

	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, ВнешниеНаборыДанных, ДанныеРасшифровки);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	
	// Обозначим начало вывода
	ПроцессорВывода.НачатьВывод();
	
	// Основной цикл вывода отчета
	Пока Истина Цикл

		// Получим следующий элемент результата компоновки
		ЭлементРезультата = ПроцессорКомпоновкиДанных.Следующий();
		
		Если ЭлементРезультата = Неопределено Тогда
			
			// Следующий элемент не получен - заканчиваем цикл вывода
			Прервать;
			
		Иначе
			
			// Элемент получен - выведем его при помощи процессора вывода
			
			ПроцессорВывода.ВывестиЭлемент(ЭлементРезультата);
			
		КонецЕсли;
		
	КонецЦикла;
	
	// Обозначим завершение вывода
	ПроцессорВывода.ЗакончитьВывод();
	
	// Нумерация колонок
    СтрокВШапке       = ДокументРезультат.ФиксацияСверху;
    КоличествоКолонок = ДокументРезультат.ШиринаТаблицы;
        
    ОбластьШапки    = ДокументРезультат.Область(СтрокВШапке, ,СтрокВШапке);
    ОбластьПриемник = ДокументРезультат.Область(СтрокВШапке + 1, ,СтрокВШапке + 1);
	ДокументРезультат.ВставитьОбласть(ОбластьШапки, ОбластьПриемник, ТипСмещенияТабличногоДокумента.ПоГоризонтали, Ложь);
        
	Для Ном = 1 по КоличествоКолонок Цикл
	    ТекОбласть = ДокументРезультат.Область(СтрокВШапке + 1, Ном);
	    ТекОбласть.Текст = Строка(Ном);
	    ТекОбласть.ГоризонтальноеПоложение = ГоризонтальноеПоложение.Центр;
	КонецЦикла;
        
	ДокументРезультат.ФиксацияСверху = ДокументРезультат.ФиксацияСверху + 1;
	
КонецПроцедуры
